
* 基本快捷键

** 帮助




| C-h k             | describe-key             | 查看某个快捷键对应的命令                  |
| C-h v             | describe-varible         | 查看变量                                  |
| C-h f             | describe-function        | 查看函数                                  |
| M-x               | execute-extended-command |                                           |
| M-x describe-face |                          | 查看face文档                              |
| C-h m             | describe-mode            | 查看某个mode的文档(包含快捷键和命令列表)  |
| C-h w             | where-is                 |                                           |
| C-h b             | describe-bindings        | 查看当前 `buffer' 中某个                  |
|                   |                          | 快捷键序列开头的快捷键列表  [fn:Chb-desc] |


| find-function        | 查看函数的代码                |
| find-variable        | 查看变量的代码                |
| find-face-definition | 查看face的代码                |
| M-x apropos          | 查看包含某个关键词的函数,face |

 + C-\ : 输入法切换，拼音

** 与文件操作有关的命令

 - C-x C-f , find-file , 查找文件并在新缓冲区中打开 
 - C-x C-v , find-alternate-file , 读入另外一个文件替换掉用 `C-x C-f'读入的文件
 - C-x i , insert-file , 把文件插入到光标的当前位置, Files->nsert File
 - C-x C-s , save-buffer, 保存文件
 - C-x C-w, write-file, 把缓冲区的内容写入一文件, Files-Save Buffer As
 - C-x C-c, save-buffers-kill-emacs, 退出Emacs
 - C-h, help-command, 进入Emacs的在线帮助系统
 - C-h t, help-with-tutorial , 启动Emacs教程
 - C-h i, info-goto-emacs-command-mode, 启动info文档阅读器

 `C-h' 是求助键，按下`C-g'组合键将退出帮助系统。

** 脚本运行
 
 - 在某条语句后面按 `C-x C-e (eval-last-sexp)' 可以执行那条语句
 - `M-x eval-buffer' 可以执行当前buffer内的Elisp代码
 - 选中一个region后, `M-x eval-region' 可以执行这个region内的代码

** 光标移动

 + C-x ] , forward-page
 + C-x [ , backward-pate
 + C-v , scroll-up
 + Esc v, 显示前一屏
 + Esc < , 去首行
 + Esc > , 去最后一行
   
 + C-q C-l ,  , 文本分页符 , `C-q'  叫做引用命令，作用是告诉Emacs把`C-l'插入到文件里去。而不是把角解释为屏幕画面命令。



** 行操作

| C-o | insertline          | (向上)插入一行         |
| C-l | recenter-top-bottom | 将当前行从下向上移动 |
| C-j | newline-and-indent  | 向下添加一行         |


** 删除

| shortcut | function              | description          |
|----------+-----------------------+----------------------|
| C-d      | delete-char           | 删除光标位置上的字符 |
| DEL      | delete-backward-char  | 删除光标前面的字符   |
| M-d      | kill-word             | 删除从光标到单词结尾 |
| M-DEL    | backward-kill-word    | 删除从光标到单词开头 |
| C-k      | kill-line             | 删除从光标位置到行尾 |
| M-k      | kill-sentence         | 删除从光标到句尾     |
| -        | ;; back-kill-sentence | -                    |


* org-mode 快捷键

** org-mode 中间移动

| C-n C-n | 移动到下一个标题                   |
| C-c C-p | 移动到上一个标题                   |
| C-c C-f | 移动到和当前标题同等级的下一个标题 |
| C-c C-b | 移动到和当前标题同等级的上一个标题 |
| C-c C-u | 向上移动到更高一层的标题           |

*** 删除

 - C-h 绑定到 `org-delete-backward-char'

** 列表

My favorite scenes are (in this order)
1. The attack of the Rohirrim
2. Eowyn’s fight with the witch king
   * this was already my favorite scene in the book
   * I really like Miranda Otto.
3. Peter Jackson being shot by Legolas
Con DVD only
He makes a really funny face when it happens.
But in the end, no individual scenes matter but the film as a whole.
Important actors in this film are:
C Elijah Wood :: He plays Frodo
C Sean Austin :: He plays Sam, Frodo’s friend. I still remember
him very well from his role as Mikey Walsh in the Goonies.

把光标移动到 ‘1.’ ‘2.’ 或 ‘3.’ 所在的行上，然后按 shift 加左右方向键，看看有什么效果。

** 注脚

注脚
~~~~~~~
在 org mode 中，你可以为你的文章添加注脚（footnote）。注脚的格式有两种，一是方括号+数字，二是方括号+fn+名字。比如下面有两个例子：
在 org mode 的正文中写下这两句话：

The Org homepage[1] now looks a lot better than it used to.
The Org homepage[fn:orghome] now looks a lot better than it used to.

接下俩你可以写一些其他东西，然后在文章的末尾写上下面两句话（注意：必须要顶格写）：

[1] The link is: http://orgmode.org
[fn:orghome] The link is: http://orgmode.org

把光标移动到正文的[1]处，按 C-c C-c，可以跳转到注脚[1]处，在注脚[1]处按 C-c C-c，可以跳转到正文的[1]处。对于[2]也一样。

**  表格

*** 基本表格

在 org mode 中，你可以画表格。方法很简单，在某一行顶格的位置输入’|'，然后输入表格第一行第一列的内容，再输入’|'，然后输入表格的的一行第二列的内容，以此类推。当第一行输入完成后，按 TAB， org mode 会把当前行对齐，然后为你创造出表格的下一行，让你继续输入。用 TAB 和 S+TAB可以在表格中正向或反向的移动。
比如下面的例子：

| 1 | one                          |
| 2 | two                          |
| 3 | This is a long chunk of text |
| 4 | four                         |
 - `S+TAB' 可以格式化表格
有时候，表格的某一项特别的长，你可以在任意一个表格的空白项内输入数字来限制其所在列的长度。比如：

|   | <6>    |
| 1 | one    |
| 2 | two    |
| 3 | This is something modified. |
| 4 | four   |

在上面的例子中，第二列的长度不会超过6，超过的部分会被隐藏起来。你可以把鼠标移动到’This=>’上面，会有浮动标签显示出该项的内容，或者输入 `C-c `' 可以编辑被隐藏的内容。如果你发现表格的某一项没有如你预期的那样被隐藏起来，你可以在表格中的任意位置按 `C-c C-c' 。

我们还可以把表格弄的更好看一些。在表格的某两行之间加入’|-’，然后按TAB，可以作出下面的效果：

| | <6> |
|―+――C|
| 1 | one |
| 2 | two |
| 3 | This=> |
| 4 | four |

** spreadsheet
================
你可以在表格中增加计算的功能。比如你有这样一个表格：第一列和第二列是三角形两个直角边的长度，第三列是通过勾股定理计算出的斜边长度，或者是这样一张表格：前几列是你各个科目的考试成绩，最后一列是你的平均分，那么，org mode 可以自动为你完成计算。我们以计算勾股定理为例，创建一张表格：

| a | b |   |
|---+---+---|
| 3 | 4 |   |
| 6 | 8 |   |
| 1 | 2 |   |

在第二行第三列中输入’=($1^2+$2^2)^0.5′。$1和$2表示第一列和第二列，在你自己的表格中，你会使用你希望的列数进行计算。

| a | b |           |
|---+---+-----------|
| 3 | 4 |        5. |
| 6 | 8 |       10. |
| 1 | 2 | 2.2360680 |
#+TBLFM: $3=($1^2+$2^2)^0.5

有时候，你输入完成后，org mode不会自动帮你对所有项都计算一边，这时，你可以输入’C-u C-c C-c’强制org mode为整个表格进行计算。如果你不想让某一列都按照公式计算，只希望在某一特定项上进行计算，你可以这样输入：’:=($1^2+$2^2)^0.5′, 即在等号前再加一个冒号。

* Footnotes

[fn:Chb-desc] <待查看的快捷键序列> C-h，比如你想查看当前buffer中所有以C-c开头的快捷键列表，按C-c C-h就可以了。
